Revit 2027 API
MEPNetworkSegmentData Properties
The MEPNetworkSegmentData type exposes the following members.
Properties
Name | Description
Coefficient |  The calculated coefficient of this segment, dimensionless.
Flow |  The calculated flow of this segment, in ft^3/s. The positive value means the flow is from the start to the end node, the negative value means opposite direction.
FlowState |  The calculated flow state of this segment.
FrictionFactor |  The calculated friction factor of this segment, dimensionless.
IsCriticalPath |  Verifies if the segment is on the critical path.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PressureDrop |  The calculated pressure drop of this segment, in kg/(ft*s^2).
RelativeRoughness |  The relative roughness of this segment, dimensionless.
ReynoldsNumber |  The Reynolds number of this segment, dimensionless.
SectionNumber |  The section this segment belongs to.
Velocity |  The calculated velocity of this segment, in ft/s.
VelocityPressure |  The calculated velocity pressure of this segment, in kg/(ft*s^2).
Top
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace